var posts = [
    {
      id: 1,
      titel: "نور آبی",
      category: "چشم",
      image: "../assets/images/blue.png",
      text: "نور آبی هم مفید و هم مضر برای چشم قدم گذاشتن در فضا باز و دیدن نور خورشید، کار با رایانه و تلفن همراه و... همه باعث می شود که چشمان شما در معرض انواع پرتوهای قابل مشاهده و نامرئی قرار بگیرند که می تواند اثرات زیادی در چشم شما داشته باشد. اکثر مردم می دانند که نور خورشید حاوی کی اشعه نور می باشد که اضعه ماورا بنفش باعث سوزاندن پوست می شود. اما آنچه که شما نمی دانید این است که نور های منعکس شده از خورشید طیف وسیعی از پورتو های نور های رنگی را شامل می شود که دارای مقادیر مختلف انرژی می باشند. نور خورشید بسته به انرژی و طول موج که به آن تابش الکترومغناطیسی نیز گفته می شود حاوی پرتو های نور قرمز،نارنجی، زرد، سبز، آبی و سایه های بسیاری از هر یک از این رنگ ها می باشد. ترکیب این طیف نور را نور سفید یا نور خورشید می نامند. بدون وارد شدن به مبحث پیچیده فیزیک، بین طول موج و پرتوهای نور و میزان انرژی موجود در آنها رابطه معکوس وجود دارد. پرتوهای نوری که طول موج طولانی دارند، انرژی کمتری از خود ساطع می کنند و برعکس پرتو های نوری موجود که در انتها آبی رنگ و کوتاه تر هستند انرژی بیشتری دارند. پرتو های الکترومغناطیس که انتهای های آن ها قرمز و طیف نور مرئی است مادون قرمز نامیده می شود آنها گرم هستند. (لامپ های گرم کننده ها که مشاهده می کنید مثل غذاخوری ها اشعه مادون قرمز از خود ساطع می کنند) و از طرف دیگر طیف نور مرئی، پرتو های نور آبی با کوتاه ترین طول موج و بالاترین سطح انرژی، به این پرتو های نامرئی الکترومغناطیس اشعه فرابنفش نیز می گویند. پرتوها یاشعه فرابنفش از انرژی بالاتری نسبت به دیگر پرتور های نور مرئی برخوردار هستند و همین امر باعث می شود که آنها بتوانند تغییراتی در پوست ایجاد کنند در حقیقت لامپ های موجود در دستگاه های سولاریوم، مقدار کنترل شده ای از این نور را از خود ساطع می کنند. قرار گرفتن بیش از حد در برابر این نور باعث سوختگی می شود و گاهی نیز اتفاق های بدتری مثل سرطان پوست را برای فرد به همراه دارد. این پرتو ها حتی می تواند باعث ایجاد آفتاب در چشم و شرایطی به نام فوتوکراتیت یا کوری برفی شوند. اما این اشعه اثرات مفیدی نیز به همراه دارد مثلا به بدن برای تولید ویتامین D کمک می کند. نور آبی نیز طیف نوری مثل نور فرا بنفش می باشد که طول موج کوتاه و سطح انرژی بالایی را از خود ساطع می کند که هم فواید و هم خطراتی را به دونبال دارد در اینجا موارد مهم را با هم مرور می کنیم. نور خورشید منبع اصلی نور آبی می باشد و ما بیشتر اوقات در طول روز در معرض این نور می باشیم همچنین بسیاری از منابع داخلی لامپ های روشنایی، LED تلویزیون ها نیز از خود این نور را ساطع می کنند. مهم ترین و قابل توجه ترین صفحه نمایش های رایانه، نوت بوک ها، و تلفن های همراه می باشد که این نور را از خود ساطع می کنند. به خاطر استفاده بیش از حد از این دستگاه ها، اثرات بسیاری بر چشم افراد می گذارد که پزشک و متخصص چشم معتقد است که سلامت چشم را به خطر می اندازد."
      },
    {
      id: 2,
      titel: "روغن زیتون",
      category: "تغذیه",
      image: "../assets/images/oil-ezgif.com-webp-to-jpg-converter.jpg",
      text: "روغن زیتون طبیعی دارای اسیدهای چرب تک غیراشباع بسیار بالایی است. در نتیجه سطح کلسترول خون را کاهش داده که به دنبال آن مشکلات قلبی کاهش می‌یابند. علاوه بر‌ این، روغن زیتون خطر ابتلا به دیابت و تصلب شرایین را کاهش می‌دهد. اولئوکانتال یک ترکیب فنلی موجود در روغن زیتون خالص است که تصور می‌شود مسئول احساس سوزش سر زبان در هنگام چشیدن این نوع روغن زیتون باشد. فنل‌های روغن زیتون دارای خواص ضد التهابی هستند و در نتیجه ممکن است اثراتی مشابه مسکن‌ها و کاهش‌دهنده‌های تب داشته باشند. اولئوکانتال همچنین پلاک‌های بتا آمیلوئید را از مغز جدا می‌کند که می‌تواند به پیشگیری از بیماری آلزایمر و از بین بردن سلول‌های سرطانی کمک کند. کلسترول تام، کلسترول LDL و تری گلیسیرید، همگی با روغن زیتون کاهش می‌یابند. کلسترول LDL نوع بدی از کلسترول است و خطر حملات قلبی و بیماری قلبی ریوی را افزایش می‌دهد. روغن زیتون خالص که حاوی نزدیک به 40 ماده شیمیایی آنتی اکسیدانی است، به کاهش اکسیداسیون کلسترول LDL کمک می‌کند. متابولیسم یا همان سوخت و ساز بدن، استخوان سازی و رشد مغز کودکان همه با روغن زیتون تقویت می‌شوند. ‌این روغن سرشار از ویتامین E است که به ویژه برای افراد مسن مفید می‌باشد."
    },
    {
      id: 3,
      titel: "ویتامین ث",
      category: "تغذیه",
      image: "../assets/images/Vc-ezgif.com-webp-to-jpg-converter.jpg",
      text: "ویتامین C یک ویتامین محلول در آب است و بدن ما نمی‌تواند به خودی خود این ویتامین را تولید کند و باید با مصرف مواد غذایی و داروهای مکمل این ویتامین را به بدن برسانیم تا از فواید ویتامین C بهره‌مند شویم. برخی از فواید ویتامین سی برای سلامت ما شامل مواردی از جمله جلوگیری از نارسایی‌های سیستم ایمنی، محافظت در برابر بیماری‌های قلبی و عروقی، محافظت در برابر مشکلات سلامتی ارثی، محافظت در برابر بیماری‌های چشم، پیشگیری از چروک شدن پوست هستند. ویتامین C خواص و فواید درمانی بسیاری دارد و بودن آن برای بدن ضروری است. باهم مطالعه میکنیم که ویتامین c برای چی خوبه، با ما همراه باشید. ویتامین C برای تولید کلاژن که یک پروتئین مهم برای ساخت پوست، تاندون‌ها رباط‌ها و رگ‌های خونی لازم است ضروری است. ویتامین C یک آنتی اکسیدان است؛ حضور آنتی اکسیدان‌ها در رژیم غذایی از ابتلا به سرطان پوست جلوگیری می‌کند. ویتامین C یک از آنتی‌اکسیدان‌ است که توانایی جلوگیری از آسیب‌های رادیکال ‌های آزاد و مواد شیمیایی خطرناک همچون دود سیگار را دارد. رادیکال‌های آزاد در بروز برخی از بیماری‌ها از جمله سرطان، بیماری‌های قلبی و ورم مفاصل نقش دارند. رادیکال‌های آزاد هنگام تجزیه غذا در بدن یا هنگام قرار گرفتن در معرض تشعشع یا دود سیگار تولید می‌شوند."
      },
    {
      id: 4,
      titel: "حساسیت فصلی",
      category: "ریه",
      image: "../assets/images/asthma-ezgif.com-webp-to-jpg-converter.jpg",
      text: "به واکنش سیستم ایمنی بدن به مواد آلرژی‌زا که در زمان‌های خاصی از سال رخ می‌دهد، حساسیت فصلی می‌گویند. مواد آلرژی‌زا معمولا شامل گرده گیاهان، مایت‌های گردوغبار، اسپور قارچ‌ها یا کپک‌ها و شوره حیوانات خانگی هستند. علائم حساسیت فصلی بهار به علف‌های تازه چیده‌شده، درختان و گل‌های تازه‌شکفته و گرده علف‌های هرز مرتبط است. رینیت آلرژیک اصطلاح پزشکی برای آلرژی‌ای است که نه تنها در بهار، بلکه در طول تابستان و پاییز هم رخ می‌دهد. آلرژی فصلی تابستان به علت گرده‌افشانی گیاهان که معمولا در اواخر فصل بهار و ابتدای تابستان ‎انجام می‌شود، رخ می‌دهد. از گیاهان حساسیت‌زای این فصل می‌توان به بومادران، چمن‌ها و علف‌های هرز اشاره کرد. آلودگی هوا و وجود آلاینده‌های محیطی هم عامل دیگر است که می‌تواند در فصل تابستان به آلرژی منجر شود. فضاهای گرم و مرطوب هم همیشه بهترین مکان‌ برای رشد باکتری‌ها، قارچ‌ها و سایر مواد حساسیت‌زا هستند. این مشکل که در فصل تابستان به دلیل گرم شدن هوا رخ می‌دهد، باعث ایجاد آلرژی می‌شود."
      }
  ];


window.onload = function (){
    bindArticles();
}

function bindArticles() {
    var articles = document.getElementById("articles");
    for(var i=0; i<posts.length; i++){
        var col = document.createElement("div");
        col.classList.add("col-12", "col-lg-3");
        var card = document.createElement("div");
        card.style.width = "100%";
        card.style.height = "26rem";
        card.classList.add("border","rounded")
        var img = document.createElement("img");
        img.src = posts[i].image;
        img.classList.add("card-img-top","rounded");
        card.appendChild(img);
        body = document.createElement("div");
        body.classList.add("card-body","p-2");
        h5 = document.createElement("h4");
        h5.classList.add("card-title","p-2", "fw-bold");
        h5.innerText = posts[i].titel;
        body.appendChild(h5);
        p = document.createElement("p");
        p.innerText = posts[i].text;
        p.classList.add("card-text");
        p.classList.add("text-truncate");
        body.appendChild(p);
        var a = document.createElement("a");
        a.href = "readArticle.html?id=" + posts[i].id;
        a.classList.add("more");
        a.innerText = "مشاهده بیشتر...";
        body.appendChild(a);
        card.appendChild(body);
        col.appendChild(card);
        articles.appendChild(col);
    }

}


