var posts = [
  {
    id: 1,
    titel: "نور آبی",
    category: "چشم",
    image: "../assets/images/blue.png",
    text: "نور آبی هم مفید و هم مضر برای چشم قدم گذاشتن در فضا باز و دیدن نور خورشید، کار با رایانه و تلفن همراه و... همه باعث می شود که چشمان شما در معرض انواع پرتوهای قابل مشاهده و نامرئی قرار بگیرند که می تواند اثرات زیادی در چشم شما داشته باشد. اکثر مردم می دانند که نور خورشید حاوی کی اشعه نور می باشد که اضعه ماورا بنفش باعث سوزاندن پوست می شود. اما آنچه که شما نمی دانید این است که نور های منعکس شده از خورشید طیف وسیعی از پورتو های نور های رنگی را شامل می شود که دارای مقادیر مختلف انرژی می باشند. نور خورشید بسته به انرژی و طول موج که به آن تابش الکترومغناطیسی نیز گفته می شود حاوی پرتو های نور قرمز،نارنجی، زرد، سبز، آبی و سایه های بسیاری از هر یک از این رنگ ها می باشد. ترکیب این طیف نور را نور سفید یا نور خورشید می نامند. بدون وارد شدن به مبحث پیچیده فیزیک، بین طول موج و پرتوهای نور و میزان انرژی موجود در آنها رابطه معکوس وجود دارد. پرتوهای نوری که طول موج طولانی دارند، انرژی کمتری از خود ساطع می کنند و برعکس پرتو های نوری موجود که در انتها آبی رنگ و کوتاه تر هستند انرژی بیشتری دارند. پرتو های الکترومغناطیس که انتهای های آن ها قرمز و طیف نور مرئی است مادون قرمز نامیده می شود آنها گرم هستند. (لامپ های گرم کننده ها که مشاهده می کنید مثل غذاخوری ها اشعه مادون قرمز از خود ساطع می کنند) و از طرف دیگر طیف نور مرئی، پرتو های نور آبی با کوتاه ترین طول موج و بالاترین سطح انرژی، به این پرتو های نامرئی الکترومغناطیس اشعه فرابنفش نیز می گویند. پرتوها یاشعه فرابنفش از انرژی بالاتری نسبت به دیگر پرتور های نور مرئی برخوردار هستند و همین امر باعث می شود که آنها بتوانند تغییراتی در پوست ایجاد کنند در حقیقت لامپ های موجود در دستگاه های سولاریوم، مقدار کنترل شده ای از این نور را از خود ساطع می کنند. قرار گرفتن بیش از حد در برابر این نور باعث سوختگی می شود و گاهی نیز اتفاق های بدتری مثل سرطان پوست را برای فرد به همراه دارد. این پرتو ها حتی می تواند باعث ایجاد آفتاب در چشم و شرایطی به نام فوتوکراتیت یا کوری برفی شوند. اما این اشعه اثرات مفیدی نیز به همراه دارد مثلا به بدن برای تولید ویتامین D کمک می کند. نور آبی نیز طیف نوری مثل نور فرا بنفش می باشد که طول موج کوتاه و سطح انرژی بالایی را از خود ساطع می کند که هم فواید و هم خطراتی را به دونبال دارد در اینجا موارد مهم را با هم مرور می کنیم. نور خورشید منبع اصلی نور آبی می باشد و ما بیشتر اوقات در طول روز در معرض این نور می باشیم همچنین بسیاری از منابع داخلی لامپ های روشنایی، LED تلویزیون ها نیز از خود این نور را ساطع می کنند. مهم ترین و قابل توجه ترین صفحه نمایش های رایانه، نوت بوک ها، و تلفن های همراه می باشد که این نور را از خود ساطع می کنند. به خاطر استفاده بیش از حد از این دستگاه ها، اثرات بسیاری بر چشم افراد می گذارد که پزشک و متخصص چشم معتقد است که سلامت چشم را به خطر می اندازد."
    },
  {
    id: 2,
    titel: "روغن زیتون",
    category: "تغذیه",
    image: "../assets/images/oil-ezgif.com-webp-to-jpg-converter.jpg",
    text: "روغن زیتون طبیعی دارای اسیدهای چرب تک غیراشباع بسیار بالایی است. در نتیجه سطح کلسترول خون را کاهش داده که به دنبال آن مشکلات قلبی کاهش می‌یابند. علاوه بر‌ این، روغن زیتون خطر ابتلا به دیابت و تصلب شرایین را کاهش می‌دهد. اولئوکانتال یک ترکیب فنلی موجود در روغن زیتون خالص است که تصور می‌شود مسئول احساس سوزش سر زبان در هنگام چشیدن این نوع روغن زیتون باشد. فنل‌های روغن زیتون دارای خواص ضد التهابی هستند و در نتیجه ممکن است اثراتی مشابه مسکن‌ها و کاهش‌دهنده‌های تب داشته باشند. اولئوکانتال همچنین پلاک‌های بتا آمیلوئید را از مغز جدا می‌کند که می‌تواند به پیشگیری از بیماری آلزایمر و از بین بردن سلول‌های سرطانی کمک کند. کلسترول تام، کلسترول LDL و تری گلیسیرید، همگی با روغن زیتون کاهش می‌یابند. کلسترول LDL نوع بدی از کلسترول است و خطر حملات قلبی و بیماری قلبی ریوی را افزایش می‌دهد. روغن زیتون خالص که حاوی نزدیک به 40 ماده شیمیایی آنتی اکسیدانی است، به کاهش اکسیداسیون کلسترول LDL کمک می‌کند. متابولیسم یا همان سوخت و ساز بدن، استخوان سازی و رشد مغز کودکان همه با روغن زیتون تقویت می‌شوند. ‌این روغن سرشار از ویتامین E است که به ویژه برای افراد مسن مفید می‌باشد."
  },
  {
    id: 3,
    titel: "ویتامین ث",
    category: "تغذیه",
    image: "../assets/images/Vc-ezgif.com-webp-to-jpg-converter.jpg",
    text: "ویتامین C یک ویتامین محلول در آب است و بدن ما نمی‌تواند به خودی خود این ویتامین را تولید کند و باید با مصرف مواد غذایی و داروهای مکمل این ویتامین را به بدن برسانیم تا از فواید ویتامین C بهره‌مند شویم. برخی از فواید ویتامین سی برای سلامت ما شامل مواردی از جمله جلوگیری از نارسایی‌های سیستم ایمنی، محافظت در برابر بیماری‌های قلبی و عروقی، محافظت در برابر مشکلات سلامتی ارثی، محافظت در برابر بیماری‌های چشم، پیشگیری از چروک شدن پوست هستند. ویتامین C خواص و فواید درمانی بسیاری دارد و بودن آن برای بدن ضروری است. باهم مطالعه میکنیم که ویتامین c برای چی خوبه، با ما همراه باشید. ویتامین C برای تولید کلاژن که یک پروتئین مهم برای ساخت پوست، تاندون‌ها رباط‌ها و رگ‌های خونی لازم است ضروری است. ویتامین C یک آنتی اکسیدان است؛ حضور آنتی اکسیدان‌ها در رژیم غذایی از ابتلا به سرطان پوست جلوگیری می‌کند. ویتامین C یک از آنتی‌اکسیدان‌ است که توانایی جلوگیری از آسیب‌های رادیکال ‌های آزاد و مواد شیمیایی خطرناک همچون دود سیگار را دارد. رادیکال‌های آزاد در بروز برخی از بیماری‌ها از جمله سرطان، بیماری‌های قلبی و ورم مفاصل نقش دارند. رادیکال‌های آزاد هنگام تجزیه غذا در بدن یا هنگام قرار گرفتن در معرض تشعشع یا دود سیگار تولید می‌شوند."
    },
  {
    id: 4,
    titel: "حساسیت فصلی",
    category: "ریه",
    image: "../assets/images/asthma-ezgif.com-webp-to-jpg-converter.jpg",
    text: "انجام روزانه ۳۰ دقیقه پیاده روی می‌تواند اثراتی در درمان بیماری‌ها، افزایش توان جسمانی، چربی سوزی، حرکات اصلاحی و رفع آسیب‌های بدنی برای افراد داشته باشد. انجام روازنه نیم ساعت پیاده روی می‌تواند به تقویت قلب وعرق، کاهش وزن، تنظیم فشار خون، کاهش اثرات جانبی داروهای شیمی درمانی، کنترل قند خون، درمان دیابت نوع دو، کاهش احتمال ابتلاء بانوان به سرطان سینه، بهبود عملکرد مغز و افزایش سطح یادگیری افراد کمک کند.عده‌ای از مردم صبح زود را برای انجام پیاده روی انتخاب می‌کنند که هرچند می‌تواند زمان مناسبی برای انجام این ورزش باشد و شادی و نشاط طول روز را بدنبال بیاورد، اما رعایت نکردن برخی از نکات اصولی باعث می‌شود تا ورزشکاران نتیجه چندانی از انجام این ورزش در نوبت صبح نگیرند.متاسفانه اشتباه رایجی که بین اکثر افرادی که صبح‌ها را برای انجام پیاده روی انتخاب می‌کنند وجود دارد، این است که پیاده روی را قبل از خوردن صبحانه انجام می‌دهند، درحالی که باید نیم ساعت بعد از خوردن صبحانه باشد."
    } ,
  {
    id: 5,
    titel: "پیاده روی",
    category: "تغذیه",
    image: "../assets/images/running.png",
    text: "انجام روزانه ۳۰ دقیقه پیاده روی می‌تواند اثراتی در درمان بیماری‌ها، افزایش توان جسمانی، چربی سوزی، حرکات اصلاحی و رفع آسیب‌های بدنی برای افراد داشته باشد. انجام روازنه نیم ساعت پیاده روی می‌تواند به تقویت قلب وعرق، کاهش وزن، تنظیم فشار خون، کاهش اثرات جانبی داروهای شیمی درمانی، کنترل قند خون، درمان دیابت نوع دو، کاهش احتمال ابتلاء بانوان به سرطان سینه، بهبود عملکرد مغز و افزایش سطح یادگیری افراد کمک کند.عده‌ای از مردم صبح زود را برای انجام پیاده روی انتخاب می‌کنند که هرچند می‌تواند زمان مناسبی برای انجام این ورزش باشد و شادی و نشاط طول روز را بدنبال بیاورد، اما رعایت نکردن برخی از نکات اصولی باعث می‌شود تا ورزشکاران نتیجه چندانی از انجام این ورزش در نوبت صبح نگیرند.متاسفانه اشتباه رایجی که بین اکثر افرادی که صبح‌ها را برای انجام پیاده روی انتخاب می‌کنند وجود دارد، این است که پیاده روی را قبل از خوردن صبحانه انجام می‌دهند، درحالی که باید نیم ساعت بعد از خوردن صبحانه باشد."
  },
  {
    id: 6,
    titel: "آلزایمر",
    category: "تغذیه",
    image: "../assets/images/alzheimer-s-disease.jpg",
    text: "آلزایمر یک بیماری مزمن تخریب کننده سلول های عصبی می باشد. این بیماری مغزی، شروعی آرام دارد ولی پیش رونده می باشد. رایج ترین علامت اولیه آن فراموش کردن انفاقات تازه یا به سختی به یادآوردن آن‌هاست. بیماری آلزایمر زمانی اتفاق می افتد که، مقداری غیرطبیعی از پروتئین ها که پلاک نام دارند، در مغز شکل گرفته و سلول های اندام ها را تحت تاثیر قرار می دهد. نتیجه تشکیل پلاک ها، مختل کردن عملکرد و فعالیت شیمیایی عادی مغز بوده که منجر به کاهش معنادار ناقلین عصبی می شود، که نتیجه این اتفاقات کاهش پیشرونده عملکرد مغز می باشد. تا زمانی که علت بد عمل کردن های پروتئین که در اولین نقطه رخ داده را ندانیم، یعنی علت ابتدایی هنوز خوب درک نشده و موضوع تحقیقات درحال انجام و گمانه زنی ها می باشد. علت بیشتر موارد آلزایمر ناشناخته است، به جز ۵-۱ درصد موارد که تفاوت های ژنتیکی مشخص شده است. فرضیه های متعددی در حال رقابت برای توضیح علت بیماری می باشند. برای جلوگیری از پیشرفت آلزایمر چه باید کرد؟ توصیه‌های خود مراقبتی به اندازه کافی استراحت کنید؛ به بدن و مغز خود استراحت دهید و خود را با کارهای سنگین فیزیکی یا فعالیت‌های فکری پیچیده خسته نکنید. استرس‌های محیطی را کنترل کنید. تا جای امکان از اضطراب‌های زندگی دور بمانید. تقویت مغز با تغذیه سالم؛ همانطور که در پیشگیری از آلزایمر صحبت کردیم، سعی کنید از غذاهای مفید برای حافظه را رژیم غذایی خود استفاده کنید. توصیه‌های طب سنتی ممکن است به شما در رعایت این مورد کمک کند. با نظر و توصیه پزشک از قرص ویتامینE (ویتامین ای) استفاده کنید. از اعضای خانواده کمک بگیرید؛ خانواده و اطرافیان خود را در جریان روند بیماری خود قرار دهید. حمایت عاطفی و برخورد درست اطرافیان با علائم شما میتواند در کاهش سرعت پیشترفت آلزایمر موثر باشد. ورزش های مفید برای مغز و سیستم عصبی؛ ورزش‌های هوازی ماننده یوگا و مدیتیشن نیز می‌تواند در شرایط روحی و جسمی شما تاثیر مثبت داشته باشد."
  },
  {
    id: 7,
    titel: "رژیم کتوژنیک",
    category: "تغذیه",
    image: "../assets/images/keto-diet.jpg",
    text: "رژیم کتوژنیک یا کتو، یک رژیم کم کربوهیدرات و پرچرب است که فواید زیادی برای سلامتی بدن دارد و می‌تواند به کاهش وزن کمک کند. همچنین می‌تواند به بهبود شرایط بیماران مبتلا به دیابت، سرطان، صرع و آلزایمر کمک کند. در این رژیم مصرف کربوهیدرات کاهش می‌یابد و چربی جایگزین آن می‌شود. یعنی منبع سوخت‌وساز بدن شما چربی خواهد بود. برخلاف تصور بسیاری از افراد که پس از شنیدن نام غذاهای پرچرب در برابرش جبهه می‌گیرند، این رژیم فواید بی‌شماری برای سلامت فیزیکی فرد خواهد داشت. در بسیاری از مطالعات این موضوع به اثبات رسیده است، که این رژیم می‌تواند در از بین بردن وزن اضافه بدن و بهبود عملکرد بدن افراد چاق را یاری کند. رژیم کتوژنیک شباهت بسیار زیادی به رژیم اتکینز و کم کربوهیدرات دارد. این رژیم مصرف کربوهیدرات را به‌شدت کاهش داده و در عوض چربی‌ها را جایگزین کربوهیدرات‌ها می‌کند. این رژیم شامل مقدار کمی کربوهیدرات (۱۰%)، مقدار متوسطی پروتئین (۲۰%) و چربی بالاست (۷۰%). در این رژیم شما روزانه ۱۲۰ گرم چربی مصرف کنید. همچنین باید مقدار کربوهیدرات مصرفی را از ۳۰۰+ گرم به حدود ۵۰ گرم در روز برسانید و ۱۲۰ گرم پروتئین در روز مصرف کنید. در رژیم کتوژنیک فرد باید سطح مصرف هر نوع ماده غذایی که حاوی کربوهیدرات است، را به حداقل برساند. در این رژیم فرد باید چربی‌ها را جایگزین مواد غذایی حاوی کربوهیدرات کند. زمانی که مصرف کربوهیدرات کاهش پیدا می‌کند، بدن فرد در حالت متابولیکی کتوز قرار می‌گیرد. زمانی که بدن در حالت کتوز قرار می‌گیرد، بدن تبدیل به بستری فوق‌العاده مناسب جهت چربی سوزی می‌شود. رژیم‌ کتوژنیک استاندارد علاوه بر کاهش وزن سبب کاهش قابل‌توجه قند خون و سطح انسولین می‌شوند."
  },
  {
    id: 8,
    titel: "پارکینسون",
    category: "تغذیه",
    image: "../assets/images/Parkinsons.jpg",
    text: "بیماری پارکینسون یک اختلال عصبی پیشرونده است که با مشکلات حرکتی شروع می‌شود. این بیماری می‌تواند بخشی از مغز شما که حرکات بدن را کنترل می‌کند، تحت تاثیر قرار دهد. پارکینسون به‌تدریج آغاز می‌شود؛ بنابراین اغلب افراد متوجه بیماری خود نمی‌شوند اما با گذشت زمان، لرزش جزئی در دست شروع شده و در نهایت این بیماری می‌تواند بر نحوه راه رفتن، صحبت کردن، خوابیدن و تفکر شما تاثیر بگذارد. در عمق مغز، منطقه‌ای به نام جسم سیاه (Substantia Nigra) وجود دارد و برخی از سلول‌های آن دوپامین تولید می‌کنند. حرکات نرم و هماهنگ عضلات بدن به وسیله‌ دوپامین امکان‌پذیر می‌شود. در بیماری پارکینسون، سلول‌های جسم سیاه شروع به مردن می‌کنند و سطح دوپامین کاهش می‌یابد. وقتی سطح دوپامین ۶۰ تا ۸۰ درصد کاهش پیدا کند، علائم بیماری پارکینسون شروع می‌شوند. علت دقیق بیماری پارکینسون ناشناخته است. برخی از دانشمندان معتقدند که این بیماری به علت مشکلات ژنتیکی و محیطی بروز می‌یابد. همچنین، پروتئین‌های غیرعادی به نام اجسام لویی (Lewy Bodies) در مغز افراد مبتلا به این بیماری یافت می‌شود. تحقیقات درباره نقش اجسام لویی در ایجاد این بیماری همچنان ادامه دارد."
  },
  {
    id: 0,
    titel: "کالری",
    category: "تغذیه",
    image: "../assets/images/calorie.png",
    text: "کالری سوزی، شاه‌کلید کاهش وزن و دستیابی به تناسب اندام است. داستان کالری‌سوزی ساده‌تر از آن است که فکرش را می‌کنید. اگر انرژی وارد شده به بدنتان، کمتر از میزان انرژی موردنیاز روزانه باشد، بدنتان از چربی‌های ذخیره استفاده می‌کند. در نتیجه، وزن کم خواهید کرد و لاغر خواهید شد. خبر خوب اینکه می‌توانید با ترفندهایی، کالری بیشتری بسوزانید و سرعت کم کردن وزن را افزایش دهید. این ترفندها هزینه‌ای ندارند و حتی در خانه قابل اجرا هستند. شاید برایتان عجیب باشد که بدانید استفاده از پله به جای آسانسور تا چه اندازه می‌تواند در کاهش وزن شما تاثیرگذار باشد. بالا رفتن از پله‌ها تقریبا دو برابر پیاده‌روی کالری می‌سوزاند و می‌تواند تاثیر زیادی در روند لاغری شما داشته باشد. میزان کالری سوزی پیاده‌روی حدود 210 تا 360 کالری در هر ساعت است و حالا این رقم را دوبرابر کنید! شگفت‌انگیز نیست؟ اگر وقت زیادی برای اجرای تمرینات ورزشی ندارید، نیازی نیست که حتما آن را در بازه زمانی محدود و پشت سرهم انجام دهید. البته حالت ایده‌آل این است که تمریناتتان متمرکز باشد، اما این کار برای کسانی که وقت زیادی ندارند شدنی نیست.تحقیقات نشان داده است که اگر بتوانید 5 دوره 30 ثانیه‌ای با شدت زیاد تمرین کنید و میان هر 30 ثانیه، 4 دقیقه استراحت کنید، می‌توانید در انتهای روز 200 کالری بسوزانید و متابولیسم بدنتان را هم برای 24 تا 48 ساعت آینده افزایش دهید. فرقی ندارد در آن سی ثانیه چه تمرینی انجام دهید، مهم این است که حرکتتان با شدت بالا باشد و ضربان‌تان را افزایش دهد.یکی دیگر از ترفندهایی که می‌توانید به کار بگیرید، اجرای پلانک است. پلانک وقت زیادی از شما نمی‌گیرد، اما به شدت چربی‌سوز است. میزان کالری سوزی پلانک در هر ده دقیقه حدود 70 کالری است که رقمی چشمگیر به‌حساب می‌آید. گاهی فکر می‌کنیم برای لاغر شدن حتما به برنامه کالری سوزی مدون نیاز داریم؛ درصورتی‌که این تصور اشتباه است. گاهی کاری به سادگی قدم زدن در خانه یا محل کار می‌تواند منجر به کالری سوزی شود.اگر کارتان به یکجانشینی طولانی‌مدت نیاز دارد، حتما باید اثرات آن را خنثی کنید تا هم درگیر اضافه وزن نشوید و هم در آینده مشکلات قلبی و عروقی به سراغتان نیایند.ساده‌ترین راه این است که به ازای هر یک ساعت نشستن، حداقل دو دقیقه پیاده‌روی داشته باشید. نکته مهم اینکه این دو دقیقه پشت سرهم و منسجم باشد. این ترفند کمک می‌کند تا اثرات یکجانشینی را خنثی کنید.قرارگرفتن در معرض دمای سرد می‌تواند باعث تحریک فعالیت چربی‌های قهوه‌ای بدن شود و درنتیجه به افزایش متابولیسم شما کمک کند. جویدن آدامس باعث به‌وجود آمدن احساس سیری و کاهش کالری دریافتی در میان‌وعده می‌شود. بعضی از مطالعات نشان داده است که آدامس حتی می‌تواند باعث افزایش متابولیسم شود. وقتی نشسته‌اید، به‌طور مداوم پاهایتان را تکان دهید یا با انگشتانتان به میز ضربه بزنید. این حرکات کوچک می‌توانند باعث افزایش سوخت و ساز و افزایش کالری مصرفی شوند."
    },
  {
    id: 10,
    titel: "اضافه وزن",
    category: "تغذیه",
    image: "../assets/images/obesity.jpg",
    text: "امروزه، افراد بیشتری نسبت به گذشته و سالیان قبل دچار اضافه وزن و چاقی هستند. به عنوان مثال آمارها در کشوری مانند آمریکا نشان می دهد که تقریبا ۷۰ درصد از جمعیت آمریکایی های ۲۰ ساله و بالاتر دارای اضافه وزن هستند. و از این تعداد، حدود یک سوم نیز چاق محسوب می شوند. دقت کنید که خود این آمار نشان می دهد تفاوت هایی بین اضافه وزن و چاقی وجود دارند و این دو یک مفهموم واحد نیستند.اضافه وزن و چاقی هرچند که تعاریف بسیار نزدیک به هم هستند اما با هم تفاوت هایی دارند. هر دوی آن ها به بالا بودن درصد چربی در بخش های مختلف بدن اشاره دارند اما درصد و میزان هر کدام متفاوت است.برای مثال کسی که چند کیلوگرم بیشتر از وزن طبیعی و نرمال خودش وزن داشته باشد میگویند اضافه وزن دارد. اما اگر همان شخص بیشتر از چند کیلوگرم (مثلا ۱۰ کیلوگرم یا بیشتر) وزن داشته باشد میگویند چاق است.مطابق یک تعریف دقیق و علمی تر، اگر شاخص توده بدنی یا BMI بین ۲۴.۹ تا ۲۹.۹ باشد شخص دارای اضافه وزن است اما اگر این شاخص برابر با ۳۰ و بیشتر از آن باشد شخص چاق محسوب می شود.رژیم لاغری نقش به سزایی در کاهش وزن ایفا میکند. شما باید با کم یک رژیم لاغری خوب کاری کنید که طی یک مدت زمان معقول وزن کم کنید. کاهش وزن ثابت در حدود یک پوند در هفته بی خطرترین راه برای کاهش وزن است. به عبارتی اگر در هفته نیم تا ۱ کیلو گرم وزن کم کنید بی خطر خواهد بود و در دراز مدت جواب خواهد داد. اگر در چیدن یک رژیم لاغری مشکل به کمک نیاز دارید، پزشک می تواند شما را به یک متخصص تغذیه ارجاع دهد."
  },
];

window.onload = function () {
  bindReadArticle();
};

function bindReadArticle() {
  var urlParams = new URLSearchParams(window.location.search);
  var articleId = parseInt(urlParams.get("id"));

  var article = posts.find(function (post) {
    return post.id === articleId;
  });

  if (article) {
    var articles = document.getElementById("articles");
    articles.innerHTML = "";
    var col = document.createElement("div");
    col.classList.add("col-12");
    var card = document.createElement("div");
    card.style.width = "100%";
    card.style.height = "100%";
    card.classList.add("border", "rounded");
    var img = document.createElement("img");
    img.src = article.image;
    img.classList.add("card-img-top2", "rounded");
    card.appendChild(img);
    body = document.createElement("div");
    body.classList.add("card-body", "p-2");
    h5 = document.createElement("h5");
    h5.classList.add("card-title", "p-2", "fw-bold");
    h5.innerText = article.titel;
    body.appendChild(h5);
    p = document.createElement("p");
    p.innerText = article.text;
    p.classList.add("card-text");
    body.appendChild(p);
    card.appendChild(body);
    col.appendChild(card);
    articles.appendChild(col);
  }
}
